assignment/assignment6/soap消息/querySoap.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000001</courseNumber><scoreType>平时成绩</scoreType><score>63</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000001</courseNumber><scoreType>期末成绩</scoreType><score>83</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000001</courseNumber><scoreType>总评成绩</scoreType><score>79</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000002</courseNumber><scoreType>平时成绩</scoreType><score>66</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000002</courseNumber><scoreType>期末成绩</scoreType><score>70</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000002</courseNumber><scoreType>总评成绩</scoreType><score>92</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000003</courseNumber><scoreType>平时成绩</scoreType><score>67</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000003</courseNumber><scoreType>期末成绩</scoreType><score>85</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000003</courseNumber><scoreType>总评成绩</scoreType><score>95</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000004</courseNumber><scoreType>平时成绩</scoreType><score>98</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000004</courseNumber><scoreType>期末成绩</scoreType><score>77</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000004</courseNumber><scoreType>总评成绩</scoreType><score>67</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000005</courseNumber><scoreType>平时成绩</scoreType><score>91</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000005</courseNumber><scoreType>期末成绩</scoreType><score>91</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>141250009</studentId><courseNumber>000005</courseNumber><scoreType>总评成绩</scoreType><score>88</score></nju:scoreRecord></SOAP-ENV:Body></SOAP-ENV:Envelope>